#+TITLE: 3.1 Exercises

** Solution
#+begin_src scheme
;; from 3.2
(define (make-monitored f)
  (let ((count 0))
    (lambda (x)
      (cond ((eq? x 'how-many-calls?)
             count)
            ((eq? x 'reset-count)
             (set! count 0))
            (else
             (begin (set! count (inc count))
                    (f x)))))))

;; call-the-cops mock
(define call-the-cops
  (make-monitored
   (lambda (crime)
     (display "Calling the cops for: ")
     (display crime)
     (newline))))

(define (make-account balance account-password)
  (define (withdraw value)
    (if (> balance value)
        (begin (set! balance (- balance value))
               balance)
        "Insuffucient balance"))

  (define (deposit value)
    (set! balance (+ balance value))
    balance)

  (define check-password
    (let ((consecutive-mistakes 0))
      (lambda (password)
        (if (eq? password account-password)
            (begin (set! consecutive-mistakes 0)
                   #t)
            (begin (set! consecutive-mistakes
                         (inc consecutive-mistakes))
                   (if (> consecutive-mistakes 7)
                       (call-the-cops "ROBBERY ATTEMPT"))
                   #f)))))

  (define (dispatch password operation)
    (if (check-password password)
        (cond ((eq? operation 'withdraw) withdraw)
              ((eq? operation 'deposit) deposit)
              (else (error "Unknown request: MAKE-ACCOUNT"
                           operation)))
        (lambda (_) "Incorrect password")))
  dispatch)

(define acc
  (make-account 100 'secret-password))

(test-equal "Incorrect password"
  ((acc 'some-other-password 'withdraw) 128))
(test-equal "Incorrect password"
  ((acc 'some-other-password 'withdraw) 64))
(test-equal "Incorrect password"
  ((acc 'some-other-password 'withdraw) 32))
(test-equal "Incorrect password"
  ((acc 'some-other-password 'withdraw) 16))
(test-equal "Incorrect password"
  ((acc 'some-other-password 'withdraw) 8))
(test-equal "Incorrect password"
  ((acc 'some-other-password 'withdraw) 4))
(test-equal "Incorrect password"
  ((acc 'some-other-password 'withdraw) 2))
(test-equal "Incorrect password"
  ((acc 'some-other-password 'withdraw) 1))

(test-equal 1 (call-the-cops 'how-many-calls?))
#+end_src

#+RESULTS:
: Calling the cops for: ROBBERY ATTEMPT

